emas/loadtest/emas-performance-report/raw_data/sp1/apache_bench_data/100cus/varnish_ab_test_100_1000000.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking qap.everythingscience.co.za (be patient)


Server Software:        Zope/(2.13.15,
Server Hostname:        qap.everythingscience.co.za
Server Port:            80

Document Path:          /portal_css/Sunburst%20Theme/public-cachekey-4fff4ed932d766e26813993d85f43eea.css
Document Length:        31966 bytes

Concurrency Level:      100
Time taken for tests:   53.900 seconds
Complete requests:      1000000
Failed requests:        0
Write errors:           0
Total transferred:      32552000000 bytes
HTML transferred:       31966000000 bytes
Requests per second:    18552.96 [#/sec] (mean)
Time per request:       5.390 [ms] (mean)
Time per request:       0.054 [ms] (mean, across all concurrent requests)
Transfer rate:          589781.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   0.4      2       9
Processing:     0    3   0.8      3     219
Waiting:        0    1   0.8      1     215
Total:          1    5   0.9      5     220

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      5
  75%      5
  80%      5
  90%      6
  95%      6
  98%      8
  99%      9
 100%    220 (longest request)